#1. Лўғатни қиймати бўйича саралаш.
#Python дастурини ёзинг, у лўғатни қийматларига кўра ўсиш ва камайиш тартибида сараласин.

d={"Akmal":35,"Sherzod":28, "Dilmurod":30, "Nodir":41,"Xusniddin":39}
yangi = {}
for key, value in d.items():
    yangi[value] = key
yangi = dict(sorted(yangi.items()))
d={}
for key, value in yangi.items():
    d[value]= key

print(d)
#2. Лўғатга янги калит қўшиш
#Python дастурини ёзинг, у мавжуд лўғатга янги калит қўшсин.

d={"Name":"Sherali", "Age":"37"}

d["Experience"]=30
d["Salary"]=20000000

print(d)



#3. Бир нечта лўғатларни бирлаштириш
#Python дастурини ёзинг, у қуйидаги лўғатларни битта янги лўғатга бирлаштирсин.
dict1={"a":1,"b":2,"c":3}
dict2={"f":4, "h":5, "k":6}
dict3={"l":7, "m":8, "n":9}

dict_jami=dict1|dict2|dict3
print(dict_jami)
#4. Квадрат қийматлар лўғати
#Python дастурини ёзинг, у 1 дан n гача бўлган сонларни (x, x*x) кўринишида лўғат қилиб чиқарсин.

d={}
for i in range(1,10):
    d[i]=i**2
print(d)
#5.1 дан 15 гача бўлган сонларнинг квадратлари лўғати
#Python дастурини ёзинг, у калитлари 1 дан 15 гача бўлган ва қийматлари шу калитларнинг квадрати бўлган лўғатни чиқарсин.

d={}
for j in range(1,16):
    d[j]=j**2
print(d)
#1.Тўплам яратиш
#Python дастурини ёзинг, у тўплам ҳосил қилсин.
d={}
d["a"]=24
d["b"]=18
d["c"]=56
print(d)

#2. Тўплам элементларини айланиб чиқиш
#Python дастурини ёзинг, у тўплам элементларини бирма-бир чиқарсин.

d={"name": "Zokir", "Profession":"Economic", "Experience":15, "Ielts":8}

for key, val in d.items():
    print(key,val) 
#3. Тўпламга элемент(лар) қўшиш
#Python дастурини ёзинг, у тўпламга битта ёки бир нечта элемент қўшсин.

d={"a":"b", "c":"d"}

d["e"]="f"
d["g"]="h"

print(d)


#4. Тўпламдан элемент(лар)ни ўчириш
#Python дастурини ёзинг, у тўпламдан битта ёки бир нечта элементни ўчириб ташласин.

d={"cat":"mushuk", "dog":"it","donkey":"eshak","lion":"sher"}
del d["lion"]
print(d)
#5. Агар элемент мавжуд бўлса, уни ўчириш
#Python дастурини ёзинг, у тўпламдан элементни фақат у мавжуд бўлса ўчирсин.

d={"olma":"meva", "qovun":"poliz", "lavya":"dukkak","tamaki":"texnik"}

d.pop('olma', None)
print(d)
